InformationRegisters/ИА_ПраваЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ПраваЗначения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ИА_ПраваПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ПраваГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Право</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_ПраваПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_ПраваЗначения/Forms/ФормаРедактор/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если НЕ ИА_ПраваС.ЕстьПолныеПраваНаПодсистему(Отказ, Истина) Тогда
	//    Возврат;
	//КонецЕсли; 
    Если Параметры.Свойство("Пользователь") Тогда
        Пользователь = Параметры.Пользователь;
    КонецЕсли;
    
    Эл = ТаблицаПрав.Параметры.Элементы.Найти("Пользователь");
    Если Эл <> Неопределено Тогда
        Эл.Значение = Пользователь;
        Эл.Использование = Истина;
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Перечитать(Команда)
    Элементы.ТаблицаПрав.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
    Эл = ТаблицаПрав.Параметры.Элементы.Найти("Пользователь");
    Если Эл <> Неопределено Тогда
        Эл.Значение = Пользователь;
        Эл.Использование = Истина;
    КонецЕсли; 
    
    Элементы.ТаблицаПрав.Обновить();
    УстановитьВидимостьДоступность();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписи(Отбор)
    МЗ = РегистрыСведений.ИА_ПраваЗначения.СоздатьМенеджерЗаписи();
    ЗаполнитьЗначенияСвойств(МЗ, Отбор);
    МЗ.Записать();    
    
    Результат = РегистрыСведений.ИА_ПраваЗначения.СоздатьКлючЗаписи(Отбор);    
    Возврат Результат;
КонецФункции
 

&НаКлиенте
Процедура ТаблицаПравВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    
    ТекСтрока = Элемент.ТекущиеДанные;
    Если ТекСтрока <> Неопределено
        И НЕ ТекСтрока.ЭтоГруппа
        Тогда
        ТипЗнач = ТекСтрока.ТипЗначения;
        ВыбЗнач = ТекСтрока.Значение;
        
        Отбор = Новый Структура("Пользователь, Право, Значение"
        , Пользователь, ТекСтрока.Право, ТекСтрока.Значение);
        
        //Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтаФорма , П);        
        //ПоказатьВводЗначения(Оповещение, ВыбЗнач, "Введите значение", ТипЗнач);
        КлючЗаписи =  ПолучитьКлючЗаписи(Отбор);
        П = Новый Структура("Ключ, ТолькоВвод", КлючЗаписи, Истина); 
        ОткрытьФорму("РегистрСведений.ИА_ПраваЗначения.ФормаЗаписи", П);
    КонецЕсли; 
    
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначения(Значение, Параметры) Экспорт
    Если Значение <> Неопределено Тогда
        ЗаписатьНаСервере(Параметры, Значение);
        Элементы.ТаблицаПрав.Обновить();
    КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьНаСервере(Параметры, ВыбЗнач)
    МЗ = РегистрыСведений.ИА_ПраваЗначения.СоздатьМенеджерЗаписи();
    ЗаполнитьЗначенияСвойств(МЗ, Параметры);
    МЗ.Значение = ВыбЗнач;
    МЗ.Записать();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
    Элементы.ТаблицаПрав.Доступность = ЗначениеЗаполнено(Пользователь);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
    УстановитьВидимостьДоступность();
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
    Если ИмяСобытия="ЗначениеПраваИзменено"
        И Параметр = Пользователь
        Тогда
        Элементы.ТаблицаПрав.Обновить();   	
    КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура Группы(Команда)
    ОткрытьФорму("Справочник.ИА_ПраваГруппыПользователей.ФормаСписка");
КонецПроцедуры


&НаКлиенте
Процедура ПросмотрПрав(Команда)
    ОткрытьФорму("РегистрСведений.ИА_ПраваЗначения.Форма.ПросмотрЗначенийПрав"
    , Новый Структура("Пользователь", Пользователь) );
КонецПроцедуры
